# SQL demo

## Creating a Database
Load the jupyter xql extension. If its not already install on terminal: 
```
pip install ipython-sql
```

In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

Connect to an in-memory SQLite database. It is also possible to create a file db, but for a tutorial, where we don't want to save the information, a in-memory db is a good idea.

In [6]:
%sql sqlite://

## First part of demo
### Create a table

In [7]:
%%sql
CREATE TABLE Students (
  StudentID INT PRIMARY KEY,
  fname VARCHAR(100),
  lname VARCHAR(100),
  age INT
);

 * sqlite://
Done.

[]

Insert data into the table

In [8]:
%%sql
INSERT INTO Students VALUES (1, 'Ana', 'Vizcaya', 100);

 * sqlite://
1 rows affected.

[]

In [9]:
%%sql
INSERT INTO Students VALUES (2, 'Student1', 'Potter', 20);

 * sqlite://
1 rows affected.

[]

In [10]:
%%sql
INSERT INTO Students VALUES (3, 'Student2', 'Granger', 21);

 * sqlite://
1 rows affected.

[]

In [11]:
%%sql
INSERT INTO Students VALUES (4, 'Student3', 'Weasley', 19);

 * sqlite://
1 rows affected.

[]

What is inside the table?

In [12]:
%%sql
SELECT * FROM Students;

 * sqlite://
Done.

[(1, 'Ana', 'Vizcaya', 100),
 (2, 'Student1', 'Potter', 20),
 (3, 'Student2', 'Granger', 21),
 (4, 'Student3', 'Weasley', 19)]

Get just a selection of data

In [13]:
%%sql
SELECT * FROM Students WHERE age < 21;

 * sqlite://
Done.

[(2, 'Student1', 'Potter', 20), (4, 'Student3', 'Weasley', 19)]

Update a value in the table

In [16]:
%%sql
UPDATE Students SET lname = 'Malfoy' WHERE StudentID = 2;

 * sqlite://
1 rows affected.

[]

Did it work? How can you check?

Now delete a row

In [17]:
%%sql
DELETE FROM Students WHERE StudentID = 4;

 * sqlite://
1 rows affected.

[]

## Second part of the demo
### Create a second table and perform an inner join
We will create a table of Enrollments and our goal will be to check to which courses

In [19]:
%%sql
CREATE TABLE Enrollments (
  StudentID INT,
  CourseID VARCHAR(50),
  PRIMARY KEY (StudentID, CourseID),
  FOREIGN KEY (StudentID) REFERENCES Students(StudentID)
);

 * sqlite://
Done.

[]

In [21]:
%%sql
INSERT INTO Enrollments (StudentID, CourseID) VALUES
  (1, 'Potions'),
  (2, 'Care of Magical Creatures'),
  (2, 'Flying'),
  (3, 'Transfiguration'),
  (4, 'Dark Arts');

 * sqlite://
5 rows affected.

[]

In [23]:
%%sql
SELECT fname, lname, CourseID
FROM Students
JOIN Enrollments ON Students.StudentID = Enrollments.StudentID;

 * sqlite://
Done.

[('Ana', 'Vizcaya', 'Potions'),
 ('Student1', 'Malfoy', 'Care of Magical Creatures'),
 ('Student1', 'Malfoy', 'Flying'),
 ('Student2', 'Granger', 'Transfiguration')]